terjeio/grblHAL/drivers/ESP32/driver.c
    hal.system_control_get_state = systemGetState;

    selectStream(StreamType_Serial);

#if EEPROM_ENABLE
  #if EEPROM_IS_FRAM
    hal.nvs.type = NVS_FRAM;
  #else
    hal.nvs.type = NVS_EEPROM;
  #endif
    hal.nvs.get_byte = eepromGetByte;
    hal.nvs.put_byte = eepromPutByte;
    hal.nvs.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
    hal.nvs.memcpy_from_with_checksum = eepromReadBlockWithChecksum;
#else
    if(nvsInit()) {
        hal.nvs.type = NVS_Flash;
        hal.nvs.memcpy_from_flash = nvsRead;
        hal.nvs.memcpy_to_flash = nvsWrite;
    } else
        hal.nvs.type = NVS_None;
#endif

#ifdef DRIVER_SETTINGS

    if(hal.nvs.type != NVS_None) {
        hal.nvs.driver_area.address = GRBL_NVS_SIZE;
        hal.nvs.driver_area.size = sizeof(driver_settings); // Add assert?
        hal.nvs.size = GRBL_NVS_SIZE + sizeof(driver_settings) + 1;

        hal.driver_setting = driver_setting;
        hal.driver_settings_restore = driver_settings_restore;
        hal.driver_settings_report = driver_settings_report;
  #if TRINAMIC_ENABLE
        hal.driver_axis_settings_report = trinamic_axis_settings_report;
  #endif
    }
#endif

//    hal.reboot = esp_restart; crashes the MCU...
    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;

    hal.show_message = showMessage;

#ifdef DEBUGOUT
    hal.debug_out = debug_out;
#endif

#if KEYPAD_ENABLE
    hal.execute_realtime = keypad_process_keypress;
#endif

#if TRINAMIC_ENABLE
    hal.user_mcode_check = trinamic_MCodeCheck;
    hal.user_mcode_validate = trinamic_MCodeValidate;
    hal.user_mcode_execute = trinamic_MCodeExecute;
    hal.driver_rt_report = trinamic_RTReport;
#endif

#if WIFI_ENABLE
    grbl.on_report_options = reportIP;
#endif
#if BLUETOOTH_ENABLE
    grbl.on_report_options = report_bt_MAC;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality

#ifndef VFD_SPINDLE
  #if IOEXPAND_ENABLE || defined(SPINDLE_DIRECTION_PIN)
    hal.driver_cap.spindle_dir = On;
  #endif
    hal.driver_cap.variable_spindle = On;
    hal.driver_cap.spindle_pwm_invert = On;
  #if PWM_RAMPED
    hal.driver_cap.spindle_at_speed = On;
  #endif
  #if IOEXPAND_ENABLE || defined(COOLANT_MIST_PIN)
    hal.driver_cap.mist_control = On;
  #endif
#endif
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;
#ifdef SAFETY_DOOR_PIN
    hal.driver_cap.safety_door = On;
#endif
#if MPG_MODE_ENABLE
    hal.driver_cap.mpg_mode = On;
#endif
#if SDCARD_ENABLE
    hal.driver_cap.sd_card = On;
#endif
#if BLUETOOTH_ENABLE
    hal.driver_cap.bluetooth = On;
#endif
#if WIFI_ENABLE
    hal.driver_cap.wifi = On;
#endif

#if MODBUS_ENABLE
    uart2Init(MODBUS_BAUD);
    modbus_stream.rx_timeout = 50;
    modbus_stream.write = uart2Write;
    modbus_stream.read = uart2Read;
    modbus_stream.flush_rx_buffer = uart2Flush;
    modbus_stream.flush_tx_buffer = uart2Flush;
    modbus_stream.get_rx_buffer_count = uart2Available;
    modbus_stream.get_tx_buffer_count = uart2txCount;
  #ifdef MODBUS_DIRECTION_PIN
    modbus_stream.set_direction = uart2Direction;
  #endif
    modbus_init(&modbus_stream);

    if((xModBusTimer = xTimerCreate("ModBusPoll", pdMS_TO_TICKS(10), pdTRUE, NULL, vModBusPollCallback)))
        xTimerStart(xModBusTimer, 0);
#endif

#ifdef SPINDLE_HUANYANG
    huanyang_init(&modbus_stream);
#endif

   // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 6;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
    TIMERG0.int_clr_timers.t0 = 1;
    TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;

    hal.stepper_interrupt_callback();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
  bool debounce = false;
  uint8_t grp = 0;
  uint32_t intr_status[2];
  intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);          // get interrupt status for GPIO0-31
  intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);         // get interrupt status for GPIO32-39
  SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
  SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]); // clear intr for gpio32-39

  uint32_t i = sizeof(inputpin) / sizeof(state_signal_t);
  do {
      i--;
      if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
          inputpin[i].active = true;
          if(inputpin[i].debounce)
              debounce = true;
          else
              grp |= inputpin[i].group;
      }
  } while(i);

  if(debounce) {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
  }

  if(grp & INPUT_GROUP_LIMIT)
      hal.limit_interrupt_callback(limitsGetState());

  if(grp & INPUT_GROUP_CONTROL)
      hal.control_interrupt_callback(systemGetState());

#if MPG_MODE_ENABLE

  static bool mpg_mutex = false;

  if((grp & INPUT_GROUP_MPG) && !mpg_mutex) {
      mpg_mutex = true;
      modeChange();
     // hal.delay_ms(50, modeChange); // causes intermittent panic... stacked calls due to debounce?
      mpg_mutex = false;
  }
#endif

#if KEYPAD_ENABLE
  if(grp & INPUT_GROUP_KEYPAD)
      keypad_keyclick_handler(gpio_get_level(KEYPAD_STROBE_PIN));
#endif
}
